# Dups online
# By Yakasami
# V0.1.0
import os
import sys
import socket
os.system('cls||clear')
sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
sock.connect(('3.71.250.82', 2222))
try:
	sock.send(bytes.fromhex(input("Введіть ваш очищений хендшейк: ")))
	sock.recv(1024)
	print('[√] Успішна відправка хендшейка')
except:
	print('[X] Невірний хендшейк')
hex = '0000004c0a2431336438633738322d623430362d346261342d396466322d6265393464613063653462631213506c6179657252656d6f7465536572766963651a0f7365744f6e6c696e65537461747573002262792059616b6173616d6922'
sock.send(bytes.fromhex(hex))
print("[√] Успішна запущено дюп онлайна")
print('''Якщо що, цей дюп онлайна працює по такому принципу, що переводить ваш аккаунт в онлайн, тим самим легітно накручує години. 
Години накручуються так само, скільки пройшло годин в реальномі житі. 
Бажано під час дюпу не заходити на аккаунт, та залишити цей скрипт працювати у фоновому режіми, не видаляючи його з вкладок. Можете просто залишати його наніч.
Також потрібно оновлювати хендшейк кожних 17 годин.
Автор цього скрипта: Yakasami
Канал автора: t.me/yakasami_hex''')
while 1:
	hex = '0000004c0a2431336438633738322d623430362d346261342d396466322d6265393464613063653462631213506c6179657252656d6f7465536572766963651a0f7365744f6e6c696e65537461747573002262792059616b6173616d6922'
	sock.send(bytes.fromhex(hex))
