import os, socket
os.system('cls||clear')

sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
sock.connect(('3.71.250.82', 2222))

token = input('Введіть ваш очищений хендшейк: ').replace(' ','')
sock.send(bytes.fromhex(token))
sock.send(bytes.fromhex(token))
o = sock.recv(1024).decode("utf-8", errors="ignore")
if o[3] == '*':
    print('[√] Успішна відправка хендшейка')
else:
    print('[X] Невірний хендшейк')
    exit()
print('''Якщо що, цей дюп онлайна працює по такому принципу, що переводить ваш аккаунт в онлайн, тим самим легітно накручує години. 
Години накручуються так само, скільки пройшло годин в реальномі житі. 
Бажано під час дюпу не заходити на аккаунт, та залишити цей скрипт працювати у фоновому режіми, не видаляючи його з вкладок. Можете просто залишати його наніч.
Також потрібно оновлювати хендшейк кожних 17 годин.
Автор цього скрипта: Yakasami+Flocker
Канал автора: t.me/yakasami_hex''')
hex = '0000004c0a2431336438633738322d623430362d346261342d396466322d6265393464613063653462631213506c6179657252656d6f7465536572766963651a0f7365744f6e6c696e65537461747573002262792059616b6173616d6922'
print('[√] Накрутка часов запущена!')
while 1:
    sock.send(bytes.fromhex(token))
    for _ in range(5):
        sock.send(bytes.fromhex(hex))
